src/cf/DataProcessors/ОбработкиНалоговИОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбработкиНалоговИОтчетности</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендарьПодготовкиОтчетности</v8:Type>
						<v8:Type>cfg:CatalogRef.КалендарьПерсональныхЗадачОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСобытийКалендаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/УменьшениеНалогаНаВзносыПодлежащиеУплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УменьшениеНалогаНаВзносыПодлежащиеУплате</Name>
			<InformationRegisterPeriodicity>Quarter</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеятельностьНаПатенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ОбработкиНалоговИОтчетности/Forms/РасшифровкаФиксированныхВзносовПатент/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	ОтчетныйПериод = Параметры.ОтчетныйПериод;

	МаксимальнаяСуммаВзноса = Цел(Параметры.МаксимальнаяСуммаВзноса);
	УменьшеноРанее = Параметры.УменьшеноРанее;
	СуммаВзносаДляУменьшенияПСН = Параметры.ВыбраннаяСуммаВзноса;
	ИспользоватьВсюСумму = Параметры.СуммаВзносаСкорректирована;
	
	ВзносПоЕдиномуТарифу = Параметры.ВзносПоЕдиномуТарифу;
	ВзносСДоходов = Параметры.ВзносСдоходов;
	ВзносСДоходовПредыдущийГод = Параметры.ВзносСДоходовПредыдущийГод;
	ВзносСДоходовТекущийГод = Параметры.ВзносСДоходовТекущийГод;
	Элементы.ВзносСДоходовПредыдущийГод.Подсказка = Параметры.ПодсказкаВзносСДоходов;
	ДоляДоходовПоПатенту = Параметры.ДоляДоходовПоПатенту;
	ВзносыИспользованныеДляУСН = Параметры.ВзносыИспользованныеДляУСН;  
	СобытиеВзносПоЕдиномуТарифу = Параметры.СобытиеВзносПоЕдиномуТарифу;
	СобытиеВзносСДоходов = Параметры.СобытиеВзносСДоходов;
	
	Элементы.СуммаВзносаДляУменьшенияПСН.Доступность = ИспользоватьВсюСумму;
	
	Элементы.ДоляДоходовПоПатенту.Видимость =
		Не УчетнаяПолитика.ПрименяетсяТолькоУСНПатент(Организация, ОтчетныйПериод);
	
	УстановитьТекстПодсказки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВзносПоЕдиномуТарифуНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(СобытиеВзносПоЕдиномуТарифу) Тогда 
		Результат = РегламентированнаяОтчетностьУСНКлиент.ОбработатьСобытиеКалендаря(
		Организация,
		СобытиеВзносПоЕдиномуТарифу);   
		
		ПараметрыФормы = Новый Структура(
		"Организация,СобытиеКалендаря", 
		Организация,
		СобытиеВзносПоЕдиномуТарифу);
		ОткрытьФорму(Результат.ИмяФормыРезультата, ПараметрыФормы);   
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВзносСДоходовТекущийГодНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(СобытиеВзносСДоходов) Тогда 
		Результат = РегламентированнаяОтчетностьУСНКлиент.ОбработатьСобытиеКалендаря(
		Организация,
		СобытиеВзносСДоходов);   
		
		ПараметрыФормы = Новый Структура(
		"Организация,СобытиеКалендаря", 
		Организация,
		СобытиеВзносСДоходов);
		ОткрытьФорму(Результат.ИмяФормыРезультата, ПараметрыФормы);   
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВсюСуммуПриИзменении(Элемент)
	
	Элементы.СуммаВзносаДляУменьшенияПСН.Доступность = ИспользоватьВсюСумму;
	Если Не ИспользоватьВсюСумму Тогда
		СуммаВзносаДляУменьшенияПСН = МаксимальнаяСуммаВзноса;
		Элементы.ДекорацияОшибка.Видимость = Ложь;
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ПроверитьВведеннуюСумму();
	Если УказанаНеПравильнаяСумма Тогда
		ТекущийЭлемент = Элементы.СуммаВзносаДляУменьшенияПСН;
		Возврат;
	КонецЕсли;
	
	ЗаписатьИЗакрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьВведеннуюСумму()

	Если Цел(СуммаВзносаДляУменьшенияПСН) > МаксимальнаяСуммаВзноса Тогда
		Элементы.ДекорацияОшибка.Заголовок = НСтр("ru ='Сумма не может быть больше суммы взносов.'");
		УказанаНеПравильнаяСумма = Истина;
	ИначеЕсли Цел(СуммаВзносаДляУменьшенияПСН) < УменьшеноРанее Тогда
		Элементы.ДекорацияОшибка.Заголовок = НСтр("ru ='Сумма не может быть меньше, чем уменьшено ранее.'");
		УказанаНеПравильнаяСумма = Истина;
	Иначе
		УказанаНеПравильнаяСумма = Ложь;
	КонецЕсли;
	Элементы.ДекорацияОшибка.Видимость = УказанаНеПравильнаяСумма;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстПодсказки()
	
	СуммаВзносаРасчетная = Цел((ВзносПоЕдиномуТарифу + ВзносСДоходов) * ДоляДоходовПоПатенту / 100);
	ФорматЧиселВПояснении = НСтр("ru = 'ЧДЦ=0; ЧН=0; ЧГ=3,0'");
	
	Если СуммаВзносаРасчетная > МаксимальнаяСуммаВзноса И ВзносыИспользованныеДляУСН <> 0 Тогда
		ОсновнойТекст = НСтр("ru = 'Всего = Остаток за прошлый год + Единый тариф + С доходов - Использовано для УСН'");
		ДополнительныйТекст = СтрШаблон("%1 + %2 + %3 - %4",
			Формат(ВзносСДоходовПредыдущийГод, ФорматЧиселВПояснении),
			Формат(ВзносПоЕдиномуТарифу, ФорматЧиселВПояснении),
			Формат(ВзносСДоходовТекущийГод, ФорматЧиселВПояснении),
			Формат(ВзносыИспользованныеДляУСН, ФорматЧиселВПояснении));
	Иначе
		Если ДоляДоходовПоПатенту < 100 Тогда
			ОсновнойТекст = НСтр("ru = 'Всего = (Остаток за прошлый год + Единый тариф + С доходов) * Доля доходов по патенту'");
			ДополнительныйТекст = СтрШаблон("(%1 + %2 + %3) * %4%%",
				Формат(ВзносСДоходовПредыдущийГод, ФорматЧиселВПояснении),
				Формат(ВзносПоЕдиномуТарифу, ФорматЧиселВПояснении),
				Формат(ВзносСДоходовТекущийГод, ФорматЧиселВПояснении),
				Формат(ДоляДоходовПоПатенту, НСтр("ru = 'ЧДЦ=2; ЧН=0; ЧГ=3,0'")));
		Иначе
			ОсновнойТекст = НСтр("ru = 'Всего = Остаток за прошлый год + Единый тариф + С доходов'");
			ДополнительныйТекст = СтрШаблон("%1 + %2 + %3",
				Формат(ВзносСДоходовПредыдущийГод, ФорматЧиселВПояснении),
				Формат(ВзносПоЕдиномуТарифу, ФорматЧиселВПояснении),
				Формат(ВзносСДоходовТекущийГод, ФорматЧиселВПояснении));
		КонецЕсли;
	КонецЕсли;
		
	ПодсказкаМаксимум = Новый Массив;
	ПодсказкаМаксимум.Добавить(ОсновнойТекст);
	ПодсказкаМаксимум.Добавить(Символы.ПС);
	ПодсказкаМаксимум.Добавить(ДополнительныйТекст);
	
	Элементы.ПодсказкаРасчетДоли.Заголовок = Новый ФорматированнаяСтрока(ПодсказкаМаксимум);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть()

	Если ЗаписатьДанные() Тогда
		
		Если Модифицированность Тогда
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("Организация", Организация);
			ПараметрыОповещения.Вставить("Период", ОтчетныйПериод);
				
			Оповестить("Запись_УменьшениеПСННаФиксированныеВзносы", ПараметрыОповещения, ЭтотОбъект);
		КонецЕсли;

		Модифицированность = Ложь;
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьДанные()
	
	Если Не Модифицированность Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если МаксимальнаяСуммаВзноса <> СуммаВзносаДляУменьшенияПСН Тогда
		МенеджерЗаписи = РегистрыСведений.УменьшениеНалогаНаВзносыПодлежащиеУплате.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = НачалоКвартала(КонецГода(ОтчетныйПериод));
		МенеджерЗаписи.Организация = Организация;
		МенеджерЗаписи.Сумма = СуммаВзносаДляУменьшенияПСН;
		МенеджерЗаписи.ДеятельностьНаПатенте = Истина;
		МенеджерЗаписи.Записать(Истина);
	ИначеЕсли Не ИспользоватьВсюСумму Тогда
		ОчиститьЗаписиРегистра();
	Иначе
		Модифицированность = Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОчиститьЗаписиРегистра()
	
	СуммаВзносаДляУменьшенияПСН = МаксимальнаяСуммаВзноса;
	
	МенеджерЗаписи = РегистрыСведений.УменьшениеНалогаНаВзносыПодлежащиеУплате.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = НачалоКвартала(КонецГода(ОтчетныйПериод));
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.ДеятельностьНаПатенте = Истина;
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

#КонецОбласти
